package com.github.bean;

import java.util.List;

/**
 * @data 2018-09-03
 * @desc
 */

public class TestBean {

    /**
     * message : ok
     * nu : 11111111111
     * ischeck : 0
     * condition : 00
     * com : yuantong
     * status : 200
     * state : 5
     * data : [{"time":"2018-08-23 09:58:40","ftime":"2018-08-23 09:58:40","context":"华伟家园东门头房快递服务中心妈妈驿站已发出自提短信,请上门自提,联系电话17662528999","location":null},{"time":"2018-08-23 09:57:40","ftime":"2018-08-23 09:57:40","context":"快件已到达华伟家园东门头房快递服务中心妈妈驿站,联系电话17662528999","location":null},{"time":"2018-08-11 21:21:02","ftime":"2018-08-11 21:21:02","context":"明怡花园14栋5号车库妈妈驿站已发出自提短信,请上门自提,联系电话18105715870","location":null},{"time":"2018-08-11 21:21:02","ftime":"2018-08-11 21:21:02","context":"快件已到达明怡花园14栋5号车库妈妈驿站,联系电话18105715870","location":null},{"time":"2018-08-09 09:25:34","ftime":"2018-08-09 09:25:34","context":"临江丽苑3期A区8栋圆通速递妈妈驿站已发出自提短信,请上门自提,联系电话17345883730","location":null},{"time":"2018-08-09 09:24:34","ftime":"2018-08-09 09:24:34","context":"快件已到达临江丽苑3期A区8栋圆通速递妈妈驿站,联系电话17345883730","location":null},{"time":"2018-08-04 09:56:26","ftime":"2018-08-04 09:56:26","context":"中南本部五食堂对面圆通速递妈妈驿站已发出自提短信,请上门自提,联系电话18973127225","location":null},{"time":"2018-08-04 09:55:26","ftime":"2018-08-04 09:55:26","context":"快件已到达中南本部五食堂对面圆通速递妈妈驿站,联系电话18973127225","location":null},{"time":"2018-08-01 16:18:30","ftime":"2018-08-01 16:18:30","context":"大坪乡农商银行旁边肖五生家妈妈驿站已发出自提短信,请上门自提,联系电话15079736558","location":null},{"time":"2018-08-01 16:17:30","ftime":"2018-08-01 16:17:30","context":"快件已到达大坪乡农商银行旁边肖五生家妈妈驿站,联系电话15079736558","location":null},{"time":"2018-06-29 11:33:22","ftime":"2018-06-29 11:33:22","context":"中睿城1号楼门卫旁妈妈驿站妈妈驿站已发出自提短信,请上门自提,联系电话18659973879","location":null},{"time":"2018-06-29 11:33:22","ftime":"2018-06-29 11:33:22","context":"快件已到达中睿城1号楼门卫旁妈妈驿站妈妈驿站,联系电话18659973879","location":null},{"time":"2018-06-26 09:18:53","ftime":"2018-06-26 09:18:53","context":"阳湖八一大道2-28号圆通快递妈妈驿站已发出自提短信,请上门自提,联系电话13855976229","location":null},{"time":"2018-06-26 09:18:53","ftime":"2018-06-26 09:18:53","context":"快件已到达阳湖八一大道2-28号圆通快递妈妈驿站,联系电话13855976229","location":null},{"time":"2018-06-17 14:43:52","ftime":"2018-06-17 14:43:52","context":"快件已到达快递到了小吃街茁耳零食店了妈妈驿站,联系电话13662115693","location":null},{"time":"2018-06-17 14:43:52","ftime":"2018-06-17 14:43:52","context":"快递到了小吃街茁耳零食店了妈妈驿站已发出自提短信,请上门自提,联系电话13662115693","location":null},{"time":"2018-06-10 12:21:24","ftime":"2018-06-10 12:21:24","context":"杨厂村正街路南圆通代办点妈妈驿站已发出自提短信,请上门自提,联系电话13849372377","location":null},{"time":"2018-06-10 12:21:24","ftime":"2018-06-10 12:21:24","context":"快件已到达杨厂村正街路南圆通代办点妈妈驿站,联系电话13849372377","location":null},{"time":"2018-06-07 16:08:58","ftime":"2018-06-07 16:08:58","context":"快件已到达亭知路672号业务员正在派送中妈妈驿站,联系电话021-67879206","location":null},{"time":"2018-06-07 16:08:58","ftime":"2018-06-07 16:08:58","context":"亭知路672号业务员正在派送中妈妈驿站已发出自提短信,请上门自提,联系电话021-67879206","location":null},{"time":"2018-05-31 20:07:02","ftime":"2018-05-31 20:07:02","context":"快件已到达临沂北路技师学院圆通快递超市妈妈驿站,联系电话18106332770","location":null},{"time":"2018-05-31 20:07:02","ftime":"2018-05-31 20:07:02","context":"临沂北路技师学院圆通快递超市妈妈驿站已发出自提短信,请上门自提,联系电话18106332770","location":null},{"time":"2018-05-30 10:57:46","ftime":"2018-05-30 10:57:46","context":"快件已到达泽州路98号拿快递妈妈驿站妈妈驿站,联系电话18221459909","location":null},{"time":"2018-05-30 10:57:46","ftime":"2018-05-30 10:57:46","context":"泽州路98号拿快递妈妈驿站妈妈驿站已发出自提短信,请上门自提,联系电话18221459909","location":null},{"time":"2018-05-29 19:53:25","ftime":"2018-05-29 19:53:25","context":"快件已到达西校园菜鸟驿站即将发送提货码妈妈驿站,联系电话18577846400","location":null},{"time":"2018-05-25 09:44:25","ftime":"2018-05-25 09:44:25","context":"佳源花都大门口圆通店妈妈驿站已发出自提短信,请上门自提,联系电话15377667309","location":null},{"time":"2018-05-25 09:44:24","ftime":"2018-05-25 09:44:24","context":"快件已到达佳源花都大门口圆通店妈妈驿站,联系电话15377667309","location":null},{"time":"2018-05-23 12:16:35","ftime":"2018-05-23 12:16:35","context":"快递到新开的快递超市芙蓉超市旁妈妈驿站已发出自提短信,请上门自提,联系电话17723937369","location":null},{"time":"2018-05-23 12:16:32","ftime":"2018-05-23 12:16:32","context":"快件已到达快递到新开的快递超市芙蓉超市旁妈妈驿站,联系电话17723937369","location":null},{"time":"2018-05-09 11:07:09","ftime":"2018-05-09 11:07:09","context":"快件已到达火炬二路纬泰超市圆通妈妈驿站妈妈驿站,联系电话18870011859","location":null},{"time":"2018-05-09 11:07:09","ftime":"2018-05-09 11:07:09","context":"火炬二路纬泰超市圆通妈妈驿站妈妈驿站已发出自提短信,请上门自提,联系电话18870011859","location":null},{"time":"2018-05-06 10:13:51","ftime":"2018-05-06 10:13:51","context":"东坡小区幼儿园南碧水5号楼圆通妈妈驿站已发出自提短信,请上门自提,联系电话15966106271","location":null},{"time":"2018-05-06 10:13:51","ftime":"2018-05-06 10:13:51","context":"快件已到达东坡小区幼儿园南碧水5号楼圆通妈妈驿站,联系电话15966106271","location":null},{"time":"2018-04-25 13:25:07","ftime":"2018-04-25 13:25:07","context":"快递请到锦尚城14栋1-7取件妈妈驿站已发出自提短信,请上门自提,联系电话17318411160","location":null},{"time":"2018-04-25 13:25:07","ftime":"2018-04-25 13:25:07","context":"快件已到达快递请到锦尚城14栋1-7取件妈妈驿站,联系电话17318411160","location":null},{"time":"2018-04-23 09:14:53","ftime":"2018-04-23 09:14:53","context":"快件已到达东门请17点及时取件圆通快递妈妈驿站,联系电话18168989760","location":null},{"time":"2018-04-23 09:14:53","ftime":"2018-04-23 09:14:53","context":"东门请17点及时取件圆通快递妈妈驿站已发出自提短信,请上门自提,联系电话18168989760","location":null},{"time":"2018-04-08 14:55:39","ftime":"2018-04-08 14:55:39","context":"警苑小区院内1号楼西侧33车库妈妈驿站已发出自提短信,请上门自提,联系电话13123712883","location":null},{"time":"2018-04-08 14:55:39","ftime":"2018-04-08 14:55:39","context":"快件已到达警苑小区院内1号楼西侧33车库妈妈驿站,联系电话13123712883","location":null},{"time":"2018-04-07 14:58:29","ftime":"2018-04-07 14:58:29","context":"兴盛园小北门妈妈驿站妈妈驿站已发出自提短信,请上门自提,联系电话18192082506","location":null},{"time":"2018-04-07 14:58:29","ftime":"2018-04-07 14:58:29","context":"快件已到达兴盛园小北门妈妈驿站妈妈驿站,联系电话18192082506","location":null},{"time":"2018-04-05 09:11:53","ftime":"2018-04-05 09:11:53","context":"乐尚二楼超市入口对面17点后取妈妈驿站已发出自提短信,请上门自提,联系电话18918021456","location":null},{"time":"2018-04-05 09:11:53","ftime":"2018-04-05 09:11:53","context":"快件已到达乐尚二楼超市入口对面17点后取妈妈驿站,联系电话18918021456","location":null},{"time":"2018-03-13 11:30:29","ftime":"2018-03-13 11:30:29","context":"快件已到达黎托街道黎锦苑8栋106号妈妈驿站,如有疑问请联系13755027160","location":null},{"time":"2018-03-13 11:30:29","ftime":"2018-03-13 11:30:29","context":"黎托街道黎锦苑8栋106号妈妈驿站已发出自提短信,请上门自提,如有疑问请联系13755027160","location":null},{"time":"2018-03-10 20:16:41","ftime":"2018-03-10 20:16:41","context":"国际关系学院妈妈驿站已发出自提短信,请上门自提,如有疑问请联系17610012989","location":null},{"time":"2018-03-10 20:16:41","ftime":"2018-03-10 20:16:41","context":"快件已到达国际关系学院妈妈驿站,如有疑问请联系17610012989","location":null},{"time":"2018-03-09 12:25:35","ftime":"2018-03-09 12:25:35","context":"孙伯镇红绿灯北800米路东圆通妈妈驿站已发出自提短信,请上门自提,如有疑问请联系18105389267","location":null},{"time":"2018-03-09 12:25:35","ftime":"2018-03-09 12:25:35","context":"快件已到达孙伯镇红绿灯北800米路东圆通妈妈驿站,如有疑问请联系18105389267","location":null},{"time":"2018-03-01 08:17:17","ftime":"2018-03-01 08:17:17","context":"虹漕路19弄21号华悦家园妈妈驿站已发出自提短信,请上门自提,如有疑问请联系15737044817","location":null},{"time":"2018-03-01 08:17:17","ftime":"2018-03-01 08:17:17","context":"快件已到达虹漕路19弄21号华悦家园妈妈驿站,如有疑问请联系15737044817","location":null},{"time":"2018-01-26 21:59:03","ftime":"2018-01-26 21:59:03","context":"景富A区东门16路旁圆通快递妈妈驿站已发出自提短信,请上门自提,如有疑问请联系13664776468","location":null},{"time":"2018-01-26 21:59:03","ftime":"2018-01-26 21:59:03","context":"快件已到达景富A区东门16路旁圆通快递妈妈驿站,如有疑问请联系13664776468","location":null},{"time":"2018-01-24 11:37:47","ftime":"2018-01-24 11:37:47","context":"银领时代2号楼时代超市妈妈驿站已发出自提短信,请上门自提,如有疑问请联系13956927234","location":null},{"time":"2018-01-24 11:37:27","ftime":"2018-01-24 11:37:27","context":"快件已到达银领时代2号楼时代超市妈妈驿站,如有疑问请联系13956927234","location":null},{"time":"2018-01-13 16:17:08","ftime":"2018-01-13 16:17:08","context":"快件已到达凉城路418号圆通速递公交站后妈妈驿站,如有疑问请联系15801900095","location":null},{"time":"2018-01-13 16:17:08","ftime":"2018-01-13 16:17:08","context":"凉城路418号圆通速递公交站后妈妈驿站已发出自提短信,请上门自提,如有疑问请联系15801900095","location":null},{"time":"2018-01-10 18:11:23","ftime":"2018-01-10 18:11:23","context":"杨庄南村龙少爷烤鸭旁圆通速递妈妈驿站已发出自提短信,请上门自提,如有疑问请联系15850947167","location":null},{"time":"2018-01-10 18:11:23","ftime":"2018-01-10 18:11:23","context":"快件已到达杨庄南村龙少爷烤鸭旁圆通速递妈妈驿站,如有疑问请联系15850947167","location":null},{"time":"2018-01-07 19:42:41","ftime":"2018-01-07 19:42:41","context":"圆通合作点【粉丝生活】快件已到达绿地旭辉城小区内物业隔壁粉丝生活服务站驿站,如有疑问请联系18946131929","location":null},{"time":"2017-12-18 17:17:58","ftime":"2017-12-18 17:17:58","context":"感恩广场生活区9区2号圆通快递妈妈驿站已发出自提短信,请上门自提,如有疑问请联系15340979298","location":null},{"time":"2017-12-18 17:17:58","ftime":"2017-12-18 17:17:58","context":"快件已到达感恩广场生活区9区2号圆通快递妈妈驿站,如有疑问请联系15340979298","location":null},{"time":"2017-12-18 16:37:45","ftime":"2017-12-18 16:37:45","context":"快件已到达华林二路40号圆通营业厅妈妈驿站,如有疑问请联系15208326965","location":null},{"time":"2017-12-18 16:37:45","ftime":"2017-12-18 16:37:45","context":"华林二路40号圆通营业厅妈妈驿站已发出自提短信,请上门自提,如有疑问请联系15208326965","location":null},{"time":"2017-12-06 14:43:57","ftime":"2017-12-06 14:43:57","context":"快件已到达每晚七-十点板泉路大门口自取妈妈驿站,如有疑问请联系021-50831622","location":null},{"time":"2017-12-06 14:43:57","ftime":"2017-12-06 14:43:57","context":"每晚七-十点板泉路大门口自取妈妈驿站已发出自提短信,请上门自提,如有疑问请联系021-50831622","location":null},{"time":"2017-11-30 13:49:45","ftime":"2017-11-30 13:49:45","context":"快件已到达凡尔赛花园二期二号楼15号门面妈妈驿站,如有疑问请联系023-63417526","location":null},{"time":"2017-11-30 13:49:45","ftime":"2017-11-30 13:49:45","context":"凡尔赛花园二期二号楼15号门面妈妈驿站已发出自提短信,请上门自提,如有疑问请联系023-63417526","location":null},{"time":"2017-11-26 12:45:35","ftime":"2017-11-26 12:45:35","context":"快件已到达稻香园南区11栋圆通妈妈驿站妈妈驿站,如有疑问请联系15068885505","location":null},{"time":"2017-11-26 09:14:57","ftime":"2017-11-26 09:14:57","context":"快件已到达清新雅苑9号楼成都川菜馆妈妈驿站,如有疑问请联系13546317781","location":null},{"time":"2017-11-26 09:14:57","ftime":"2017-11-26 09:14:57","context":"清新雅苑9号楼成都川菜馆妈妈驿站已发出自提短信,请上门自提,如有疑问请联系13546317781","location":null},{"time":"2017-11-18 15:28:25","ftime":"2017-11-18 15:28:25","context":"海怡嘉园百思特超市妈妈驿站已发出自提短信,请上门自提,如有疑问请联系18353222003","location":null},{"time":"2017-11-18 15:28:24","ftime":"2017-11-18 15:28:24","context":"快件已到达海怡嘉园百思特超市妈妈驿站,如有疑问请联系18353222003","location":null},{"time":"2017-11-12 14:37:23","ftime":"2017-11-12 14:37:23","context":"快件已到达颍州南路御景城6栋1单元101妈妈驿站,如有疑问请联系13855871959","location":null},{"time":"2017-11-12 14:37:23","ftime":"2017-11-12 14:37:23","context":"颍州南路御景城6栋1单元101妈妈驿站已发出自提短信,请上门自提,如有疑问请联系13855871959","location":null},{"time":"2017-10-26 12:02:51","ftime":"2017-10-26 12:02:51","context":"老校体育馆南20米路东圆通网点妈妈驿站已发出自提短信,请上门自提,如有疑问请联系18560465196","location":null},{"time":"2017-10-26 12:02:51","ftime":"2017-10-26 12:02:51","context":"快件已到达老校体育馆南20米路东圆通网点妈妈驿站,如有疑问请联系18560465196","location":null},{"time":"2017-10-26 11:23:19","ftime":"2017-10-26 11:23:19","context":"快件到鑫河湾领域六单元01妈妈驿站已发出自提短信,请上门自提,如有疑问请联系0351-2397126","location":null},{"time":"2017-10-26 11:23:19","ftime":"2017-10-26 11:23:19","context":"快件已到达快件到鑫河湾领域六单元01妈妈驿站,如有疑问请联系0351-2397126","location":null},{"time":"2017-10-23 16:30:34","ftime":"2017-10-23 16:30:34","context":"插花中学东街口路北十米圆通快递妈妈驿站已发出自提短信,请上门自提,如有疑问请联系18158928623","location":null},{"time":"2017-10-23 16:30:34","ftime":"2017-10-23 16:30:34","context":"快件已到达插花中学东街口路北十米圆通快递妈妈驿站,如有疑问请联系18158928623","location":null},{"time":"2017-10-12 22:11:23","ftime":"2017-10-12 22:11:23","context":"快件已到达睿城B4栋3单元不便自取请致电妈妈驿站,如有疑问请联系18945009357","location":null},{"time":"2017-10-12 22:11:23","ftime":"2017-10-12 22:11:23","context":"睿城B4栋3单元不便自取请致电妈妈驿站已发出自提短信,请上门自提,如有疑问请联系18945009357","location":null},{"time":"2017-09-26 11:24:53","ftime":"2017-09-26 11:24:53","context":"南航大活圆通代理点取件妈妈驿站已发出自提短信,请上门自提,如有疑问请联系18014730012","location":null},{"time":"2017-09-26 11:24:52","ftime":"2017-09-26 11:24:52","context":"快件已到达南航大活圆通代理点取件妈妈驿站,如有疑问请联系18014730012","location":null},{"time":"2017-09-01 20:12:51","ftime":"2017-09-01 20:12:51","context":"环东广场圆通快递云兰租车部妈妈驿站已发出自提短信,请上门自提,如有疑问请联系18552351543","location":null},{"time":"2017-09-01 20:12:51","ftime":"2017-09-01 20:12:51","context":"快件已到达环东广场圆通快递云兰租车部妈妈驿站,如有疑问请联系18552351543","location":null},{"time":"2017-08-30 09:02:31","ftime":"2017-08-30 09:02:31","context":"圆通合作点【收发室】快件已到达前台驿站,如有疑问请联系13337713618","location":null},{"time":"2017-08-23 09:12:48","ftime":"2017-08-23 09:12:48","context":"快件已到达东师人文西校区快递中心妈妈驿站,如有疑问请联系17743125815","location":null},{"time":"2017-08-23 09:12:48","ftime":"2017-08-23 09:12:48","context":"东师人文西校区快递中心妈妈驿站已发出自提短信,请上门自提,如有疑问请联系17743125815","location":null},{"time":"2017-07-24 21:17:01","ftime":"2017-07-24 21:17:01","context":"快件已到达派送中妈妈驿站,如有疑问请联系63762999","location":null},{"time":"2017-07-19 11:51:15","ftime":"2017-07-19 11:51:15","context":"快件已到达寨沙移动公司正对面圆通快递点妈妈驿站,如有疑问请联系13677824226","location":null},{"time":"2017-06-22 13:26:09","ftime":"2017-06-22 13:26:09","context":"联盟路与向阳交叉南100米圆通妈妈驿站已发出自提短信,请上门自提,如有疑问请联系13014796333","location":null},{"time":"2017-06-22 13:26:09","ftime":"2017-06-22 13:26:09","context":"快件已到达联盟路与向阳交叉南100米圆通妈妈驿站,如有疑问请联系13014796333","location":null},{"time":"2017-06-07 11:21:03","ftime":"2017-06-07 11:21:03","context":"快件已到达北服小北门圆通速递妈妈驿站,如有疑问请联系13370110797","location":null},{"time":"2017-06-07 11:21:03","ftime":"2017-06-07 11:21:03","context":"北服小北门圆通速递妈妈驿站已发出自提短信,请上门自提,如有疑问请联系13370110797","location":null}]
     */

    private String message;
    private String nu;
    private String ischeck;
    private String condition;
    private String com;
    private String status;
    private String state;
    private List<DataBean> data;

    public String getMessage() {
        return message;
    }

    public void setMessage(String message) {
        this.message = message;
    }

    public String getNu() {
        return nu;
    }

    public void setNu(String nu) {
        this.nu = nu;
    }

    public String getIscheck() {
        return ischeck;
    }

    public void setIscheck(String ischeck) {
        this.ischeck = ischeck;
    }

    public String getCondition() {
        return condition;
    }

    public void setCondition(String condition) {
        this.condition = condition;
    }

    public String getCom() {
        return com;
    }

    public void setCom(String com) {
        this.com = com;
    }

    public String getStatus() {
        return status;
    }

    public void setStatus(String status) {
        this.status = status;
    }

    public String getState() {
        return state;
    }

    public void setState(String state) {
        this.state = state;
    }

    public List<DataBean> getData() {
        return data;
    }

    public void setData(List<DataBean> data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * time : 2018-08-23 09:58:40
         * ftime : 2018-08-23 09:58:40
         * context : 华伟家园东门头房快递服务中心妈妈驿站已发出自提短信,请上门自提,联系电话17662528999
         * location : null
         */

        private String time;
        private String ftime;
        private String context;
        private Object location;

        public String getTime() {
            return time;
        }

        public void setTime(String time) {
            this.time = time;
        }

        public String getFtime() {
            return ftime;
        }

        public void setFtime(String ftime) {
            this.ftime = ftime;
        }

        public String getContext() {
            return context;
        }

        public void setContext(String context) {
            this.context = context;
        }

        public Object getLocation() {
            return location;
        }

        public void setLocation(Object location) {
            this.location = location;
        }
    }

    @Override
    public String toString() {
        return "TestBean{" +
                "message='" + message + '\'' +
                ", nu='" + nu + '\'' +
                ", ischeck='" + ischeck + '\'' +
                ", condition='" + condition + '\'' +
                ", com='" + com + '\'' +
                ", status='" + status + '\'' +
                ", state='" + state + '\'' +
                ", data=" + data +
                '}';
    }
}
